import styled from "styled-components";

const SidebarContainer = styled.div`
  flex: 1;
  font-size: 16px;
  font-style: normal;
  font-weight: 400;
  line-height: 24px;
  background: #f7f8f9;
  padding: 0 88px;

  p {
    margin-bottom: 16px;
  }
`;

const Sidebar = () => {
  return (
    <SidebarContainer>
      <p>
        <b>
          პესონალური მონაცემების დამუშავება პირდაპირი მარკეტინგის მიზნებისთვის
        </b>
      </p>
      <p>
        2024 წლის 01 მარტიდან ცვლილება შედის „პერსონალურ მონაცემთა დაცვის
        შესახებ“ საქართველოს კანონში და იმისათვის, რომ თქვენი, როგორც მონაცემთა
        სუბიექტის პერსონალური მონაცემები დავამუშაოთ პირდაპირი მარკეტინგის
        მიზნებისთვის, აუცილებელია, რომ მოვიპოვოთ თქვენი{" "}
        <b>ინფორმირებული და ნებაყოფლობითი თანხმობა.</b>
      </p>
      <p>
        იმ შემთხვევაში, თუ თქვენი სურვილია, რომ 01.03.2024-დან კვლავ მიიღოთ
        მარკეტინგული სახის შეტყობინებები იმ ტელეფონის ნომერზე, რომელზეც
        გეგზავნებათ აღნიშნული SMS და იმ ელ. ფოსტის მისამართზე, რომელიც დაცულია
        ჩვენთან ან მიუთითებთ ქვემოთ ველებში და ხართ არანაკლებ 16 წლის, გთხოვთ,
        გაიაროთ ვერიფიკაცია და მიუთითოთ თქვენი პირადი ნომერი და ის კოდი, რომელიც
        გამოგეგზავნებათ ტელეფონის ნომერზე.
      </p>
    </SidebarContainer>
  );
};

export default Sidebar;
